{
    "title": "GhostShell: Streaming LLM Function Calls for Concurrent Embodied Programming",
    "mainGif": "/videos/tasks.mp4", 
    "authorList":[
        {
            "name": "Jacky Liang",
            "url": "//jacky.io"
        },
        {
            "name": "Wenlong Huang",
            "url": "//wenlong.page/"
        },
        {
            "name": "Fei Xia",
            "url": "//fxia22.github.io/"
        },
        {
            "name": "Peng Xu",
            "url": ""
        },
        {
            "name": "Karol Hausman",
            "url": "//karolhausman.github.io/"
        },
        {
            "name": "Brian Ichter",
            "url": "//karolhausman.github.io/"
        },
        {
            "name": "Pete Florence",
            "url": "//karolhausman.github.io/"
        },
        {
            "name": "Andy Zeng",
            "url": "//karolhausman.github.io/"
        }
    ],
    "abstract": "We present GhostShell, a novel approach that leverages Large LanguageModels (LLMs) to enable streaming and concurrent behavioral programming for embodiedsystems. In contrast to conventional methods that rely on pre-scheduled action sequencesor behavior trees, GhostShell drives embodied systems to act on-the-fly by issuing functioncalls incrementally as tokens are streamed from the LLM. GhostShell features a streamingXML function token parser, a dynamic function interface mapper, and a multi-channelscheduler that orchestrates intra-channel synchronous and inter-channel asynchronousfunction calls, thereby coordinating serial-parallel embodied actions across multiple roboticcomponents as directed by the LLM. We benchmark GhostShell on our robot prototypeCOCO through extensive experiments, covering performance evaluation across representive LLMs, over one hundred real-world tasks, and comparisons against baselines built onLLMs’ native function calling APIs. The results demonstrate that GhostShell outperformsnative function call baselines with faster response times and more flexible behaviororchestration. Among the evaluated LLMs, Claude Sonnet 4 consistently achieved the bestoverall performance. GhostShell also proved effective in long-horizon tasks, such as mirrorself-recognition and object-finding, demonstrating its strong robustness and generalization.",
    "mainImg": "",
    "mainVideo": "/videos/3_min_explainer.mp4"
}